app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `username` = 'd'
 LIMIT 1
---
    public function authenticate()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'username' => 'required',
            'password' => 'required'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->with('errors', $validation->getErrors());
        }
        $nom = $this->request->getPost('username');
        $motpass = $this->request->getPost('password');
        $m = new UserModel();
        $user = $m->where('username', $nom)->first();