app/Models/AccountModel.php

SELECT *
FROM `account`
---
    public function getAllAccounts() {
        return $this->findAll();  // Cette méthode récupère tous les voyages de la table 'voyages'