app/Models/ActivityModel.php

    public function getAllActivitiesWithCategory()
    {
        $builder = $this->builder();
        $builder->select('activities.*, categories.name as category_name');
        $builder->join('categories', 'categories.id = activities.category_id', 'left');
        $query = $builder->get();
---
SELECT `activities`.*, `categories`.`name` as `category_name`
FROM `activities`
LEFT JOIN `categories` ON `categories`.`id` = `activities`.`category_id`